app/controllers/devices_controller.rb

  def index
    @devices=User.find(session[:user_id]).devices
    @calendars=User.find(session[:user_id]).calendars
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT `devices`.* FROM `devices` WHERE `devices`.`user_id` = 2
SELECT `calendars`.* FROM `calendars` WHERE `calendars`.`user_id` = 2

  def get
    @device = Device.where(id: params[:device_id], user_id: session[:user_id]).first
---
SELECT  `devices`.* FROM `devices` WHERE `devices`.`id` = 396 AND `devices`.`user_id` = 2  ORDER BY `devices`.`id` ASC LIMIT 1

  def update
    e = Device.where(id: params[:device_id], user_id: session[:user_id]).first
    e.name = params[:device_name] if params[:device_name]
    e.address = params[:device_address] if params[:device_address]
    e.obs = params[:device_obs] if params[:device_obs]
    e.sn = params[:device_sn] if params[:device_sn]
    e.lat = params[:device_lat] if params[:device_lat]
    e.lng = params[:device_lng] if params[:device_lng]
    e.save
---
SELECT  `devices`.* FROM `devices` WHERE `devices`.`id` = 396 AND `devices`.`user_id` = 2  ORDER BY `devices`.`id` ASC LIMIT 1
UPDATE `devices` SET `sn` = '1233', `lat` = NULL, `lng` = NULL, `updated_at` = '2015-10-04 10:58:25' WHERE `devices`.`id` = 396