app/controllers/playlist_controller.rb

SELECT `calendars`.* FROM `calendars` WHERE `calendars`.`user_id` = 2
SELECT `mediafiles`.* FROM `mediafiles` WHERE `mediafiles`.`user_id` = 2
SELECT `plistmediafiles`.* FROM `plistmediafiles` WHERE `plistmediafiles`.`plist_id` IN (1, 2, 3, 4, 5)
SELECT `plists`.* FROM `plists` WHERE `plists`.`user_id` = 2
SELECT `devices`.* FROM `devices` WHERE `devices`.`user_id` = 2
---
  def index
    @calendars = Calendar.where(user_id: session[:user_id])
    @media = Mediafile.where(user_id: session[:user_id])
    @plists = Plist.where(user_id: session[:user_id]).includes(:plistmediafiles)
    @devices = Device.where(user_id: session[:user_id])

INSERT INTO `calendarmediafiles` (`start`, `end`, `parentcalendarmediafile_id`, `created_at`, `updated_at`) VALUES ('2015-08-28 03:00:00', '2015-08-28 03:10:00', 152, '2015-08-28 06:38:44', '2015-08-28 06:38:44')
INSERT INTO `parentcalendarmediafiles` (`calendar_id`, `tstart`, `volume`, `destmediatype`, `mediafile_id`, `audio`, `from`, `to`, `d1`, `d2`, `d3`, `d4`, `d5`, `d6`, `d0`, `created_at`, `updated_at`) VALUES (1, '2000-01-01 03:00:00.000000', 30, 3, 283, 1, '2015-08-28', '2015-08-28', 1, 1, 1, 1, 1, 1, 1, '2015-08-28 06:38:44', '2015-08-28 06:38:44')
---
  def add
    parent = Parentcalendarmediafile.new
    data = Calendarmediafile.new
    _start = Time.at((params[:start]).to_i/1000).utc.strftime('%Y-%m-%d %H:%M.%S')
    parent.calendar_id = params[:calendar_id]
    data.start = _start
    data.end = data.start + ( ["1","2"].include?(params[:mediatype]) ? 1.hour : 10.minute )
    parent.tstart = data.start.to_s(:time)
    parent.duration1 = ["1","2"].include?(params[:mediatype]) ? 1 : 0
    parent.volume = ["3","4"].include?(params[:mediatype]) ? 30 : 0
    parent.destmediatype = params[:mediatype]
    parent.mediafile_id = params[:mediafile_id] if params[:mediatype]=="3" or params[:mediatype]=="4" or params[:mediatype]=="5"
    parent.plist_id= params[:mediafile_id] if params[:mediatype]=="1" or params[:mediatype]=="2"
    parent.audio = true if params[:mediatype]=="1" or params[:mediatype]=="3" or params[:mediatype]=="5"
    parent.hdmi = !parent.audio
    parent.from = _start.to_date
    parent.to = _start.to_date
    parent.d1, parent.d2, parent.d3, parent.d4, parent.d5, parent.d6, parent.d0 = 1, 1, 1, 1, 1, 1, 1
    parent.save

SELECT  `calendarmediafiles`.* FROM `calendarmediafiles` WHERE `calendarmediafiles`.`id` = 2846 LIMIT 1
SELECT  `mediafiles`.* FROM `mediafiles` WHERE `mediafiles`.`id` = 283 LIMIT 1
---
  def repeat
    @event = Calendarmediafile.find(params[:event_id])

SELECT  `calendarmediafiles`.* FROM `calendarmediafiles` WHERE `calendarmediafiles`.`id` = 2846 LIMIT 1
UPDATE `parentcalendarmediafiles` SET `tstart` = '2000-01-01 07:00:00.000000', `duration1` = NULL, `duration2` = NULL, `repeat` = 90, `every` = 30, `hdmi` = NULL, `updated_at` = '2015-08-28 06:39:30' WHERE `parentcalendarmediafiles`.`id` = 152
DELETE FROM `calendarmediafiles` WHERE `calendarmediafiles`.`id` = 2847
SELECT `calendarmediafiles`.* FROM `calendarmediafiles` WHERE `calendarmediafiles`.`parentcalendarmediafile_id` = 42
INSERT INTO `calendarmediafiles` (`parentcalendarmediafile_id`, `start`, `end`, `created_at`, `updated_at`) VALUES (42, '2015-08-19 06:00:00', '2015-08-19 23:59:29', '2015-08-28 06:36:02', '2015-08-28 06:36:02')
---
  def saverepeat
    event = Calendarmediafile.find(params[:event_id])
    parent = event.parentcalendarmediafile
    audio,hdmi = params[:audio], params[:hdmi]
    if not audio and not hdmi
	audio=true if parent.destmediatype==1 or parent.destmediatype==3 or parent.destmediatype==5
	hdmi =true if parent.destmediatype==2 or parent.destmediatype==4
    end
    @caltype=parent.destmediatype
    parent.update(from: params[:from], to: params[:to],
	    d1: params[:d1],d2: params[:d2],d3: params[:d3],d4: params[:d4],d5: params[:d5],d6: params[:d6],d0: params[:d0],
	    tstart: params[:start], duration1: params[:duration1], duration2: params[:duration2], repeat: params[:repeat] || 0,
	    every: params[:every] || 0, volume: params[:volume], audio: audio, hdmi: hdmi )
    Calendarmediafile.where(parentcalendarmediafile_id: event.parentcalendarmediafile_id).destroy_all
    offset = "+0300"
    params[:from].to_date.upto(params[:to].to_date) do |date|
	if eval('params[:d'+(date.wday).to_s+']=="on"')
	    start = (date.to_s+' '+params[:start]).to_datetime.change(offset: offset)
	    if [3,4,5].include?(@caltype)
		for i in 1..[1,parent.repeat].max
		    end1 = start + (@caltype==5 ? parent.duration1.hour + parent.duration2.minute : 10.minute)
		    Calendarmediafile.create(parentcalendarmediafile_id: event.parentcalendarmediafile_id, start: start.to_s, end: end1.to_s) if date.to_date==end1.to_date

SELECT parentcalendarmediafiles.*, calendarmediafiles.* FROM `parentcalendarmediafiles` INNER JOIN `calendarmediafiles` ON `calendarmediafiles`.`parentcalendarmediafile_id` = `parentcalendarmediafiles`.`id` WHERE (calendar_id = '1' and destmediatype = '1' and '2015-08-27' between date(start) and date(end))
SELECT  `mediafiles`.* FROM `mediafiles` WHERE `mediafiles`.`id` = 283 LIMIT 1
SELECT  `plists`.* FROM `plists` WHERE `plists`.`id` = 2 LIMIT 1
---
  def get
    @data = Parentcalendarmediafile.select('parentcalendarmediafiles.*, calendarmediafiles.*')
	    .joins(:calendarmediafiles)
	    .where('calendar_id = ? and destmediatype = ? and ? between date(start) and date(end)', params[:calendar_id], params[:mediatype], params[:start])
    @events = Array.new
    @data.each do |t|
      case t.destmediatype
      when 1
        color = t.plist.color
      when 2
        color = t.plist.color
      when 3
        color = '#3a87ad'
      when 4
        color = '#3a87ad'
      end
      @events.push({  'id' => t.id,
                      'start' => t.start,
                      'end' => t.end,
                      'title' => (t.mediafile_id ? Mediafile.find(t.mediafile_id).name : Plist.find(t.plist_id).name),
                      'color' => color,
                      'plist_id' => t.plist_id || '',
                      'mediafile_id' => t.mediafile_id || '',
                      'type' => t.destmediatype,
                      'has_repeat' => (t.to - t.from > 0 ? "1" : "0" ),
                      'repeat_days' => get_days(t),
      })

SELECT  `calendarmediafiles`.* FROM `calendarmediafiles` WHERE `calendarmediafiles`.`id` = 2943 LIMIT 1
UPDATE `calendarmediafiles` SET `start` = '2015-08-28 06:00:00', `end` = '2015-08-28 06:10:00', `updated_at` = '2015-08-28 06:38:48' WHERE `calendarmediafiles`.`id` = 2943
---
  def update
    event = Calendarmediafile.find(params[:id])
    event.start = params[:start] if params[:start]
    event.end = params[:end] if params[:end]
    event.save

SELECT  `calendarmediafiles`.* FROM `calendarmediafiles` WHERE `calendarmediafiles`.`id` = 3211 LIMIT 1
DELETE FROM `calendarmediafiles` WHERE `calendarmediafiles`.`id` = 3248
DELETE FROM `parentcalendarmediafiles` WHERE `parentcalendarmediafiles`.`id` = 153
SELECT `calendarmediafiles`.* FROM `calendarmediafiles` WHERE `calendarmediafiles`.`parentcalendarmediafile_id` = 153
SELECT  `parentcalendarmediafiles`.* FROM `parentcalendarmediafiles` WHERE `parentcalendarmediafiles`.`id` = 153 LIMIT 1
---
  def destroy
    event = Calendarmediafile.find(params[:event_id])
    if params[:series] == "1"
	Calendarmediafile.where(parentcalendarmediafile_id: event.parentcalendarmediafile_id).destroy_all
        Parentcalendarmediafile.find(event.parentcalendarmediafile_id).destroy

SELECT `devices`.`id` FROM `devices` WHERE `devices`.`user_id` = 2 AND `devices`.`calendar_id` = 1
---
  def get_devices
    devices=Device.where(user_id: session[:user_id], calendar_id: params[:calendar_id]).select('id')

UPDATE `devices` SET `devices`.`calendar_id` = 1 WHERE `devices`.`user_id` = 2 AND `devices`.`id` IN (396, 395, 394, 401, 393, 391, 399, 400, 402, 406)
---
  def attach_devices
    Device.where(user_id: session[:user_id], calendar_id: params[:calendar_id]).update_all(calendar_id: 0)