app/controllers/serial_controller.rb

INSERT INTO `logs` (`operation`, `created_at`, `updated_at`) VALUES ('Update 0000000061d96257 object Calendarmediafile', '2015-08-27 09:50:56', '2015-08-27 09:50:56')
SELECT  `devices`.* FROM `devices` WHERE `devices`.`sn` = '0000000061d96257'  ORDER BY `devices`.`id` ASC LIMIT 1
SELECT  `calendars`.* FROM `calendars` WHERE `calendars`.`id` = 25 LIMIT 1
SELECT `calendarmediafiles`.* FROM `calendarmediafiles` WHERE (parentcalendarmediafile_id in (SELECT `parentcalendarmediafiles`.`id` FROM `parentcalendarmediafiles` WHERE `parentcalendarmediafiles`.`calendar_id` = 1) and date(start)>='2015-08-27' and '2015-08-27'<=date(DATE_ADD(end,INTERVAL 3 DAY)))
SELECT `parentcalendarmediafiles`.* FROM `parentcalendarmediafiles` WHERE (calendar_id in (1) and date(`from`)>='2015-08-27' and '2015-08-27'<=date(DATE_ADD(`to`,INTERVAL 3 DAY)))
SELECT MAX(`logs`.`created_at`) FROM `logs` WHERE `logs`.`id` = 0
SELECT `logs`.* FROM `logs` WHERE `logs`.`id` = 0
SELECT MAX(`mediafiles`.`created_at`) FROM `mediafiles` WHERE `mediafiles`.`user_id` = 2
SELECT `mediafiles`.* FROM `mediafiles` WHERE `mediafiles`.`user_id` = 2
---
  def index
    rasp='{}'
    t = Time.now.to_date
    Log.create(operation: "Update "+params[:serial]+" object "+params[:object])
    device=Device.where(sn: params[:serial]).first
    render text: "Invalid license" and return if not device
    if device and params[:object]
        if ['Mediafile','Plist'].include?(params[:object])
	    rasp=eval(params[:object]+'.where(user_id: device.user_id)')
	elsif params[:object]=='Calendar'
	    rasp=Calendar.where(id: device.calendar_id)
	elsif params[:object]=='Calendarmediafile'
	    calendar=Calendar.find(device.calendar_id)
	    ids = Parentcalendarmediafile.select('id').where(calendar_id: calendar.id)
	    rasp = Calendarmediafile.where(['parentcalendarmediafile_id in (?) and date(start) between ? and date(DATE_ADD(?,INTERVAL 14 DAY))', ids, t, t])
	elsif params[:object]=='Parentcalendarmediafile'
	    calendar=Calendar.find(device.calendar_id)
	    rasp = Parentcalendarmediafile.where(['calendar_id=? and ? between date(`from`) and date(`to`)', calendar.id, t])
	elsif params[:object]=='Plistmediafile'
	    ids=Plist.select('id').where(user_id: device.user_id)
	    rasp = Plistmediafile.where(plist_id: ids)
	else
	    rasp=Log.where(id: 0)
	end
	begin
	    max=rasp.maximum(:created_at).strftime("%s")