app/controllers/timelines_controller.rb

SELECT `calendars`.* FROM `calendars` WHERE `calendars`.`user_id` = 2
SELECT `devices`.* FROM `devices` WHERE `devices`.`user_id` = 2
---
  def index
    @calendars = Calendar.where(user_id: session[:user_id])
    @devices = Device.where(user_id: session[:user_id])

SELECT  `devices`.* FROM `devices` WHERE `devices`.`user_id` = 2 AND `devices`.`id` = 394  ORDER BY `devices`.`id` ASC LIMIT 1
SELECT  `calendars`.* FROM `calendars` WHERE `calendars`.`user_id` = 2 AND `calendars`.`id` = 1  ORDER BY `calendars`.`id` ASC LIMIT 1
UPDATE `devices` SET `calendar_id` = 1, `updated_at` = '2015-08-27 09:51:43' WHERE `devices`.`id` = 394
---
  def map
    map = Device.where(user_id: session[:user_id], id: params[:device_id]).first
    calendar = Calendar.where(user_id: session[:user_id], id: params[:calendar_id]).first
    map.calendar_id = calendar.id
    map.save