app/controllers/uploads_controller.rb

SELECT `mediafiles`.* FROM `mediafiles` WHERE `mediafiles`.`user_id` = 2 AND `mediafiles`.`mediatype` = 1  ORDER BY `mediafiles`.`name` ASC
---
  def media
    @mediatype = params[:mediatype]
		@plists = Plist.where(:user_id => session[:user_id],mediatype: @mediatype)
  	@files = Mediafile.where(:user_id => session[:user_id], :mediatype => @mediatype).order(:name)