app/controllers/uploads_controller.rb

INSERT INTO `mediafiles` (`name`, `user_id`, `mediatype`, `ext`, `created_at`, `updated_at`) VALUES ('final 1', 2, 3, '.wma', '2015-08-28 06:38:27', '2015-08-28 06:38:27')
UPDATE `mediafiles` SET `checksum` = 'ad51d21142c4b479baac8802062f28b1b77804cbc246581cb2948da8859d891f', `size` = 0.0, `updated_at` = '2015-08-28 06:38:27' WHERE `mediafiles`.`id` = 283
---
  def upload
    params[:song].each do |uploaded_song|
      ext=File.extname(uploaded_song.original_filename)
      filename=File.basename(uploaded_song.original_filename,ext)
      song=Mediafile.create(:name => filename.force_encoding("UTF-8"), :user_id => session[:user_id], :mediatype => params[:mediatype],:ext => ext)
      device=Device.find(params[:device_id]) if params[:device_id].to_i != 0
      song.devices << device if device
      directory_name = Rails.root.to_s+"/public/songs/"+session[:user_id].to_s
      Dir.mkdir(directory_name) unless Dir.exists?(directory_name)
      saved_name=Rails.root.join('public','songs', session[:user_id].to_s, song.id.to_s+ext)
      File.open(saved_name, 'w') do |file|
          file.write(uploaded_song.read.force_encoding("UTF-8"))
      end
      song.checksum=Digest::SHA2.file(saved_name).hexdigest
      song.size=File.size(saved_name)/1024/1024
      song.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
  def media
    @device_id = params[:device_id].to_i || 0
    @mediatype = params[:mediatype]
    @device = User.find(session[:user_id]).devices.find(params[:device_id]) if @device_id != 0